DataProcessors/упРМКонтрольИИсполнениеРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМКонтрольИИсполнениеРейсов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресаПогрузкиПоРейсу</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>дрвРаботыПоТекущемуРейсу</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>дрвРаботыПоТекущемуРейсуЭталон</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочкиСИзмененнымиВГХГрузов</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочкиСИзмененнымСоставомГрузов</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяСкладскойУчетНаХабах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаПланировщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаПланировщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьФакт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьКарту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьПланировщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рейсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рейс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинНачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксКонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТочекПоРейсу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутыПоРейсам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рейс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пройдена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановоеПрибытие</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановоеУбытие</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрибытиеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УбытиеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрохождениеТочки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упПрохождениеТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусТочки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериодаПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериодаПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериодаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериодаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварныйСоставГруза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресРазгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиныйГруз</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНоменклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проблема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПроблемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упУпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеНаПеревозкуГруза</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМестоРодитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГрузов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/упРМКонтрольИИсполнениеРейсов/Forms/ФормаВводВремени/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мсвМаршрут = Параметры.Маршрут;
	Если ТипЗнч(мсвМаршрут) = Тип("Массив") Тогда
		Для каждого Элемент Из мсвМаршрут Цикл
			НоваяСтрока = Маршрут.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			НоваяСтрока.ПрибытиеФактТекущее = НоваяСтрока.ПрибытиеФакт;
			НоваяСтрока.НачалоРаботФактТекущее = НоваяСтрока.НачалоРаботФакт;
			НоваяСтрока.УбытиеФактТекущее = НоваяСтрока.УбытиеФакт;
			Если Истина
				И НЕ НоваяСтрока.Выполнена
				И НЕ НоваяСтрока.Отменена Тогда
				НоваяСтрока.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура МаршрутПрибытиеПриИзменении(Элемент)
	ТекущиеДанные 		= Элементы.Маршрут.ТекущиеДанные;
	ИндексТекущейСтроки = Маршрут.Индекс(ТекущиеДанные); 	
	ПересчитатьВремя(ИндексТекущейСтроки, "ПрибытиеФакт");
КонецПроцедуры

&НаКлиенте
Процедура МаршрутНачалоРаботПриИзменении(Элемент)
	ТекущиеДанные 		= Элементы.Маршрут.ТекущиеДанные;
	ИндексТекущейСтроки = Маршрут.Индекс(ТекущиеДанные); 	
	ПересчитатьВремя(ИндексТекущейСтроки, "НачалоРаботФакт");
КонецПроцедуры

&НаКлиенте
Процедура МаршрутУбытиеПриИзменении(Элемент)
	ТекущиеДанные 		= Элементы.Маршрут.ТекущиеДанные;
	ИндексТекущейСтроки = Маршрут.Индекс(ТекущиеДанные); 	
	ПересчитатьВремя(ИндексТекущейСтроки, "УбытиеФакт");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	мсвСтрокиМаршрута = Новый Массив;
	сткСтрока = Новый Структура("Пометка,
							|ПрибытиеФакт,
							|НачалоРаботФакт,
							|УбытиеФакт");
	Для каждого Строка Из  Маршрут Цикл
		
		сткНоваяСтрока = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(сткСтрока);
		ЗаполнитьЗначенияСвойств(сткНоваяСтрока, Строка);
		сткНоваяСтрока.ПрибытиеФакт 		= Строка.ПрибытиеФактТекущее;
		сткНоваяСтрока.НачалоРаботФакт 	= Строка.НачалоРаботФактТекущее;
		сткНоваяСтрока.УбытиеФакт 		= Строка.УбытиеФактТекущее;
		мсвСтрокиМаршрута.Добавить(сткНоваяСтрока);
	
	КонецЦикла;

	Закрыть(мсвСтрокиМаршрута);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для каждого Строка Из Маршрут Цикл
		Если НЕ Строка.Выполнена И НЕ Строка.Отменена Тогда
			Строка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого Строка Из Маршрут Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ПересчитатьВремя(ИндексСтроки, ИмяПоля)
	
	СтрокаОтсчета	= Маршрут.Получить(ИндексСтроки);
	Разница 		= СтрокаОтсчета[ИмяПоля + "Текущее"] -  СтрокаОтсчета[ИмяПоля];
	мсвПомеченныеСтроки 	 = Маршрут.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоПомеченныхСтрок = мсвПомеченныеСтроки.Количество();
	
	ОграничениеНаДатуДляСтроки = упСервисныеФункцииВызовСервера.ДатаСеанса() - КоличествоПомеченныхСтрок;
	
	Отказ = Ложь;
	
	Если ИмяПоля = "ПрибытиеФакт" Тогда
		
		Если СтрокаОтсчета.ПрибытиеФактТекущее > ОграничениеНаДатуДляСтроки Тогда
			ТекстСообщения = Нстр("ru = 'Введенная дата является датой будущего периода, дата не должна превышать %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОграничениеНаДатуДляСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Маршрут", ИндексСтроки + 1, "ПрибытиеФактТекущее"),,Отказ);	
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаОтсчета.НачалоРаботФактТекущее = СтрокаОтсчета.НачалоРаботФакт + Разница;
		
		Если СтрокаОтсчета.НачалоРаботФактТекущее < СтрокаОтсчета.ПрибытиеФактТекущее Тогда
			СтрокаОтсчета.НачалоРаботФактТекущее = СтрокаОтсчета.ПрибытиеФактТекущее;
		КонецЕсли;
		
		Если СтрокаОтсчета.НачалоРаботФактТекущее > ОграничениеНаДатуДляСтроки Тогда
			СтрокаОтсчета.НачалоРаботФактТекущее = ОграничениеНаДатуДляСтроки;
		КонецЕсли;
		
		СтрокаОтсчета.УбытиеФактТекущее = СтрокаОтсчета.УбытиеФакт + Разница;
		
		Если СтрокаОтсчета.УбытиеФактТекущее < СтрокаОтсчета.НачалоРаботФактТекущее Тогда
			СтрокаОтсчета.УбытиеФактТекущее = СтрокаОтсчета.НачалоРаботФактТекущее;
		КонецЕсли;
		
		Если СтрокаОтсчета.УбытиеФактТекущее > ОграничениеНаДатуДляСтроки Тогда
			СтрокаОтсчета.УбытиеФактТекущее = ОграничениеНаДатуДляСтроки;
		КонецЕсли;

		
	ИначеЕсли ИмяПоля = "НачалоРаботФакт" Тогда
		
		Если СтрокаОтсчета.НачалоРаботФактТекущее > ОграничениеНаДатуДляСтроки Тогда
			ТекстСообщения = Нстр("ru = 'Введенная дата является датой будущего периода, дата не должна превышать %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОграничениеНаДатуДляСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Маршрут", ИндексСтроки + 1, "НачалоРаботФактТекущее"),,Отказ);	
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаОтсчета.УбытиеФактТекущее = СтрокаОтсчета.УбытиеФакт + Разница;
		
		Если СтрокаОтсчета.УбытиеФактТекущее < СтрокаОтсчета.НачалоРаботФактТекущее Тогда
			СтрокаОтсчета.УбытиеФактТекущее = СтрокаОтсчета.НачалоРаботФактТекущее;
		КонецЕсли;
		
		Если СтрокаОтсчета.УбытиеФактТекущее > ОграничениеНаДатуДляСтроки Тогда
			СтрокаОтсчета.УбытиеФактТекущее = ОграничениеНаДатуДляСтроки;
		КонецЕсли;
	
	Иначе
		
		Если СтрокаОтсчета.УбытиеФактТекущее > ОграничениеНаДатуДляСтроки Тогда
			ТекстСообщения = Нстр("ru = 'Введенная дата является датой будущего периода, дата не должна превышать %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОграничениеНаДатуДляСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Маршрут", ИндексСтроки + 1, "УбытиеФактТекущее"),,Отказ);	
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	ОграничениеНаДатуДляСтроки  = ОграничениеНаДатуДляСтроки + 1;
	УбытиеФактИзПредыдущейТочки = СтрокаОтсчета.УбытиеФактТекущее;
	
	Если НЕ Разница = 0 Тогда
		
		Для ТекущийИндексСтроки = ИндексСтроки + 1 По Маршрут.Количество() - 1 Цикл
								
			Строка = Маршрут.Получить(ТекущийИндексСтроки);
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.ПрибытиеФактТекущее 	= Строка.ПрибытиеФакт + Разница;
			Строка.НачалоРаботФактТекущее = Строка.НачалоРаботФакт + Разница;
			Строка.УбытиеФактТекущее 	= Строка.УбытиеФакт + Разница;
			
			Если УбытиеФактИзПредыдущейТочки >= Строка.ПрибытиеФактТекущее Тогда
				Строка.ПрибытиеФактТекущее = УбытиеФактИзПредыдущейТочки + 1;
			КонецЕсли;
			
			Если Строка.ПрибытиеФактТекущее > ОграничениеНаДатуДляСтроки Тогда
				Строка.ПрибытиеФактТекущее = ОграничениеНаДатуДляСтроки;
			КонецЕсли;
			
			Если Строка.ПрибытиеФактТекущее > Строка.НачалоРаботФактТекущее Тогда
				Строка.НачалоРаботФактТекущее = Строка.ПрибытиеФактТекущее;
			КонецЕсли;
			
			Если Строка.НачалоРаботФактТекущее > ОграничениеНаДатуДляСтроки Тогда
				Строка.НачалоРаботФактТекущее = ОграничениеНаДатуДляСтроки;
			КонецЕсли;
			
			Если Строка.НачалоРаботФактТекущее > Строка.УбытиеФакт Тогда
				Строка.УбытиеФактТекущее = Строка.НачалоРаботФактТекущее;
			КонецЕсли;
			
			Если Строка.УбытиеФактТекущее > ОграничениеНаДатуДляСтроки Тогда
				Строка.УбытиеФактТекущее = ОграничениеНаДатуДляСтроки;
			КонецЕсли;

			УбытиеФактИзПредыдущейТочки = Строка.УбытиеФактТекущее; 
			
			ОграничениеНаДатуДляСтроки = ОграничениеНаДатуДляСтроки + 1;
			
		КонецЦикла;
		     			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
